package test.test.magicSquare;

public class MagicSquare {
    public static void main(String[] args) {
        //魔方数组
        String[][]  board = {
                {"0,0","1,1","0,2","3,3","1,4","3,5","0,6","1,7","0,8"},
                {"1,0","5,1","1,2","1,3","2,4","1,5","1,6","5,7","1,8"},
                {"2,0","2,1","2,2","0,3","0,4","0,5","2,6","2,7","2,8"},
                {"3,0","3,1","3,2","5,3","5,4","5,5","3,6","3,7","3,8"},
                {"4,0","1,1","4,2","4,3","1,4","4,5","4,6","1,7","4,8"},
                {"5,0","4,1","5,2","2,3","4,4","2,5","5,6","4,7","5,8"}};
        /**
         * 指令 定义
         *      前中  qz
         *      前上  qs
         *      前下  qx
         *      前左  qz
         *      前右  qy
         *      中层  zc
         *      下层  xc
         *      上   s
         *      下   x
         *      左   z
         *      右   y
         *
         * 动作 指令      (层，动作，次数)
         *      前中 上    qz,s
         *      前中 下    qz,x
         *      前中 左    qz,z
         *      前中 右    qz,y
         *      前上 左    qs,z
         *      前上 右    qs,y
         *      前下 左    qx,z
         *      前下 右    qx,y
         *      前左 上    qz,s
         *      前左 下    qz,x
         *      前右 上    qy,s
         *      前右 下    qy,x
         *      中层 左    zc,z
         *      中层 右    zc,y
         *      下层 左    xc,z
         *      下层 右    xc,y
         */

//
        /**
         * 主流程
         *1，构建魔方结构链表
         *2，第一层公式
         * 3，第二层公式
         * 4，第三层公式
         * 终止
         */
    }

    /**
     * 构建魔方结构链表
     *
     *
     */
    public  void constructMagicSquareFun(){
    //1
    }
    /**
     * 第一层公式
     * 1。先把0色中心归位
     * 2。依次归位中心十字
     * 3。归位第一层角块
     */
    public  void firstConstructFun(){

    }
    /**
     * 第二层公式
     * 1。二层中心色块归位
     * 2。依次归位二层角色块
     */
    public  void secondConstructFun(){
        ///ss
    }
    /**
     * 第三层公式
     * 1。拼中心十字
     * 2。中心十字归位
     * 3。角色块归位
     */
    public  void threeConstructFun(){
        //111
    }
}
